#+title: Operators - Lab practice
#+AUTHOR: Marcus Birkenkrahe (pledged)
#+startup: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both
* Overview

- *Duration*: 50 minutes
- *Goal*: Practice logical operators and basic conditionals in C
- *Class Size*: 30 students
- *Tools*: Google Cloud Shell (ide.cloud.google.com), ~nano~ editor
- *Plan*:
  - 2 min: Introduction
  - 35 min: Hands-on exercises (3 tasks)
  - 10 min: Review and discussion
  - 3 min: Zip files and wrap-up

- This section follows chapter 3 in Davenport/Vine (2015) and chapters
  4 and 5 in King (2008).

- This lesson plan was designed with assistance from Grok, an AI
  created by xAI, to help tailor exercises for your learning
  experience.

* Instructions

- Follow along as we work through these exercises together.
- Predict outputs before running the code—write your guesses down!
- Ask questions if you get stuck.

* DONE Logical Operators (15 min)

1) Open Google Cloud Shell (ide.cloud.google.com).

2) Download the template:
   #+begin_src bash :results output
     wget -O ../src/logical.c tinyurl.com/logical-output
     file ../src/logical.c
   #+end_src

   #+RESULTS:
   : ../src/logical.c: C source, ASCII text

3) Open ~logical.c~ in ~nano~:
   #+begin_src bash
     nano logical.c
   #+end_src

4) Complete the ~printf~ statements by filling in the ~...~ with logical
   expressions based on the comments. Replace ~?~ with your predicted
   output (0 or 1).

5) Code template with solutions:
   #+begin_src C :tangle ../src/logical_solution.c :results output :main no :includes
     #include <stdio.h>
     int main(void) {
       int i, j, k;

       // 1. Check if i is greater than j
       i = 10, j = 5;
       printf("%d = %d\n", i > j, 1); // 10 > 5 is TRUE (1)

       // 2. Check if i AND j are both true (non-zero)
       i = 5, j = 0;
       printf("%d = %d\n", i && j, 0); // 5 && 0 is FALSE (0)

       // 3. Check if NOT i OR j is true
       i = 0, j = 2;
       printf("%d = %d\n", !i || j, 1); // !0 is 1, 1 || 2 is TRUE (1)

       return 0;
     }
   #+end_src

   #+RESULTS:
   : 1 = 1
   : 0 = 0
   : 1 = 1

6) Compile and run:
   #+begin_src bash :results output
     gcc ../src/logical_solution.c -o logical && ./logical
   #+end_src
   #+RESULTS:
   : 1 = 1
   : 0 = 0
   : 1 = 1

* DONE Upper/Lower Case Check (10 min)

1) Download the template:

   #+begin_src bash :results output
     wget -O ../src/letter.c tinyurl.com/letter-c-template
     file ../src/letter.c
   #+end_src

   #+RESULTS:
   : ../src/letter.c: C source, ASCII text

2) Open ~letter.c~ in ~nano~.

3) Complete the code to check if the input letter is 'b' or 'B':
   #+begin_src C :results output :tangle ../src/letter_solution.c
     #include <stdio.h>
     int main(void) {
       char letter;
       printf("Enter a letter: ");
       scanf("%c", &letter);
       printf("%c\n", letter);
       if (letter == 'b' || letter == 'B') {
         printf("You entered 'b' or 'B'.\n");
       } else {
         printf("You entered something else.\n");
       }
       return 0;
     }
   #+end_src

4) Compile and test with 'b', 'B', and another letter:
   #+begin_src bash :results output
     gcc ../src/letter_solution.c -o letter 
     echo 'b' | ./letter
     echo 'B' | ./letter
     echo "Marcus" | ./letter
   #+end_src
   #+RESULTS:
   : Enter a letter: b
   : You entered 'b' or 'B'.
   : Enter a letter: B
   : You entered 'b' or 'B'.
   : Enter a letter: M
   : You entered something else.

* DONE Range Check (10 min)
1) Download the template:
   #+begin_src bash
     wget -O range.c tinyurl.com/range-template
   #+end_src
2) Open ~range.c~ in ~nano~.
3) Complete the code to check if ~i~ is in the interval ~[m,n)~:
   #+begin_src C :results output :tangle ../src/range_solution.c
     #include <stdio.h>
     int main(void) {
       int i, m, n;
       printf("Enter i, m, n: ");
       scanf("%d %d %d", &i, &m, &n);
       if (m <= i && i < n) {
         printf("%d is in [%d,%d).\n", i, m, n);
       } else {
         printf("%d is NOT in [%d,%d).\n", i, m, n);
       }
       return 0;
     }
   #+end_src
4) Compile and test with:
   - ~5 0 10~ (should be in range)
   - ~11 0 10~ (should be out of range)
   #+begin_src bash
     gcc range.c -o range && ./range
   #+end_src
   #+RESULTS:

* Wrap-Up (3 min)
1) Zip your files:
   #+begin_src bash
     zip operators.zip logical.c letter.c range.c
   #+end_src
2) Verify the archive:
   #+begin_src bash
     file operators.zip
   #+end_src
   #+RESULTS:
   : operators.zip: Zip archive data, at least v1.0 to extract
3) Upload ~operators.zip~ to Canvas (if instructed).

* Extra Practice (Optional)
- Try the other exercises (ASCII, chained expressions) in your own time—files are available online!
